import { log } from 'console';
import config from './config.js';
import test from './test.js';
import { copyFilter, copyScan, ffmetrics, ffmpeg, scan } from './core.js';

export { config, test, copyFilter, copyScan, ffmpeg, scan };

export default config;

await config();

await test();

//await ffmpeg("F:\\Аниме\\[Топ]\\Альтернативная игра богов\\BD1080p\\[AniDub]_Choujigen_Game_Neptune_The_Animation_[03]_[BDrip1080p_x264_AC3]_[Cuba77].mkv");
//await ffmpeg("F:\\Аниме\\[Топ]\\Альтернативная игра богов\\BD1080p\\[AniDub]_Choujigen_Game_Neptune_The_Animation_[09]_[BDrip1080p_x264_AC3]_[Cuba77].mkv");
//await ffmpeg("F:\\Аниме\\[Топ]\\Альтернативная игра богов\\BD1080p\\[AniDub]_Choujigen_Game_Neptune_The_Animation_[10]_[BDrip1080p_x264_AC3]_[Cuba77].mkv");
//await ffmpeg("F:\\Аниме\\[Топ]\\Альтернативная игра богов\\BD1080p\\[AniDub]_Choujigen_Game_Neptune_The_Animation_[11]_[BDrip1080p_x264_AC3]_[Cuba77].mkv");
//await ffmpeg("F:\\Аниме\\[Топ]\\Альтернативная игра богов\\BD1080p\\[AniDub]_Choujigen_Game_Neptune_The_Animation_[12]_[BDrip1080p_x264_AC3]_[Cuba77].mkv");
//await ffmpeg("F:\\Аниме\\[Топ]\\Альтернативная игра богов\\BD1080p\\[AniDub]_Choujigen_Game_Neptune_The_Animation_[13]_[OVA]_[BDrip1080p_x264_AC3]_[Cuba77].mkv");

//await ffmpeg("F:\\Аниме\\Онгоинги\\!_07_Лето_2017\\Семь - верно, три - неверно\\[AniDub]_Nana_Maru_San_Batsu_[11]_[720p_x264_Aac]_[MVO].mp4");
//await ffmpeg("F:\\Аниме\\Онгоинги\\!_07_Лето_2017\\Семь - верно, три - неверно\\[AniDub]_Nana_Maru_San_Batsu_[12]_[720p_x264_Aac]_[MVO].mp4");

//await scan("F:\\Аниме\\Онгоинги\\!_07_Лето_2017\\Семь - верно, три - неверно");
//await scan("F:\\Аниме\\Онгоинги\\!_10_Весна_2018\\Потерянная песня");

//await ffmpeg("D:\\Convert\\files\\Чудесные истории фестиваля Микавы _ Genshin Impact _ Полное прохождение ивента _ Без комментариев.mp4");

//await copyFilter("D:\\Аниме\\[Топ]\\[Топ-3]\\Кайдзю №8\\ТВ-2\\Kaijuu_8_Gou_2_[01]_[HEVC].mkv");
//await copyScan("D:\\Аниме\\Онгоинги\\!_38_Весна_2025\\Монолог фармацевта\\ТВ-2");

//await ffmpeg("F:\\Convert\\files\\JamClub_Dr_Stone_Science_Future_03_1080p.mp4");
//await ffmpeg("F:\\Convert\\files\\[DC] Make Heroine ga Oosugiru - 07_Telegram.mp4");

//await scan("F:\\Аниме\\[Фильмы]\\[Фильм] Алита - Боевой ангел");

//await scan("F:\\Аниме\\LightFamily\\Пустоголовая ведьма\\ТВ-1");
//await scan("F:\\Аниме\\LightFamily\\Пустоголовая ведьма\\ТВ-2");

//await scan("F:\\Аниме\\Китай\\Пощади меня великий господин");

//await scan("F:\\Аниме\\Онгоинги\\!_32_Осень_2023\Спокойной ночи, мир");

//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\Бродяга Кэншин\\OVA");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\Мой счастливый брак\\ТВ-2");

//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Доктор Стоун\\ТВ-4");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Драконий жемчуг Дайма");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Игра на триллион");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\История о служащем, который стал одним из четырёх Небесных Царей, когда отпра");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Исюра");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Карта детектива Такао Амэку");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Клинок зла");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Поднятие уровня в одиночку");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Полное исследование");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Рубеж Шангри-Ла - Любитель игрошлака бросает вызов топ-игре");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Семь смертных грехов");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Синие Мибуро");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Туалетный мальчик Ханако");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Фармагия");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\JamClub\\Я стал учителем в школе монстров!");

//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\JamClub\\Энн Ширли");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\Дьявол может плакать");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\Карманы лета");

//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\JamClub\\Ранма 1_2\\ТВ-2");

//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\JamClub\\Fate\\Странная подделка");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\JamClub\\Для тебя во всём цвету");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\JamClub\\Магическая битва\\ТВ-3");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\JamClub\\Медалистка\\ТВ-1");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\JamClub\\Медалистка\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\JamClub\\Провожающая в последний путь Фрирен\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\JamClub\\Раб спецотряда демонического города\\ТВ-1");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\JamClub\\Раб спецотряда демонического города\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\JamClub\\Тацуки Фуджимото - С семнадцати до двадцати шести");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\JamClub\\Тёмная луна - Кровавый алтарь");

//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Акварион - Миф об эмоциях");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Безымянная память");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Брачные узы с семьёй Амагами");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Вавамвавам Вампир");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Вечера с кошкой");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Девушка, в которую я влюбился на Окинаве, говорит на диалекте, и с ней трудно иметь дело");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Добро пожаловать в Японию, госпожа эльф!");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Жизнь сорокалетнего мужчины в другом мире");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Медалистка");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Мой счастливый брак");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\О движении Земли");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Парадоксальный навык «Мастер фруктов»");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Переродившись аристократом-неудачником, я потратил всё своё свободное время, чтобы стать великим магом!");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Перерождение мужчины средних лет в дочь дворянина");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Почему-то в моём доме поселилась куноичи-отаку");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Сладкий лимонад");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Старик, перевоплотившийся в кота");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Худшая работа «оценщика» оказалась самой сильной");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Цветок, распускающийся подобно Асуре");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Я женился на однокласснице, которую ненавидел");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Я монстр S-класса Бегемот, но меня перепутали с котом");
//await scan("F:\\Аниме\\Онгоинги\\!_37_Зима_2025\\DreamCast\\Я секретарь гильдии, но я не люблю сверхурочную работу, поэтому я собираюсь подчинить босса в одиночку");

//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Акварион - Миф об эмоциях");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Боевой отряд «Полный провал»\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Быть героем Икс");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Ветролом\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Вечера с кошкой\\ТВ-3");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Гениальный целитель, который исцелял в одно мгновение");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Дети семьи Сиундзи");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Енотики Быстрого Реагирования");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Захват мира кайдзю");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Карманы лета");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Копэн");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Маленький гражданин\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Может ли существовать дружба между мужчиной и женщиной (Нет, это не так!)");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Начало после конца");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Необъятный океан\\ТВ-1");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Непонятый мастер ателье - Обычная история о бывшем помощнике в отряде героя");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Непостижимая Ахарэн\\ТВ-1");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Непостижимая Ахарэн\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Обычный роман в Цзюлуне");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Один на вылет");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Пожалуйста, оденьтесь, Такаминэ");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Пока ведьма не умрёт");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Пока-пока, Земля\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Пришелец Муму");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Прячься, Макина!");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Рок - женская скромность");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Слегка настойчивая тёмная эльфийка последовала за мной из другого мира");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Соседнему королевству продали святую");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Старик из деревни становится Святым мечом");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Старик, перевоплотившийся в кота");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Тёмный дворецкий\\ТВ-4");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Убивая слизней триста лет, сама того не заметив, я достигла максимального уровня\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_38_Весна_2025\\DreamCast\\Хроники людей и демонов");

//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Бесклассовый герой - Да мне всё равно не нужны эти ваши умения");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Вампир не умеет правильно сосать");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Ванпанчмен\\ТВ-3");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Вечность Югурэ");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Ганглион");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Гинтама - 3-Z класс Гинпачи-сэнсэя");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Две тысячи двухсотый год Япония - страна кошек");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Дуолинго - Последний тест");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Захват мира кайдзю");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Копэн");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Леди со странным вкусом и безумный герцог");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Механическая Мари");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Могу я попросить ещё кое-что");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Мой статус убийцы очевидно превосходит геройский");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Не трогай меня, Котэсаши");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Нежить и Неудача");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Неумелый сэмпай");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Нукиташи");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Обычные дни Яно");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Один на вылет");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Один танец");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Пересечение стен любви с тобой");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Путешествие коллекционера по другому миру");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Санда");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Семья шпиона\\ТВ-3");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Сказание об обручальных кольцах\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Тандзабуро Тоджима хочет стать Наездником в маске");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Читосэ внутри бутылки рамунэ");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Шальной последний босс явился!");
//await scan("F:\\Аниме\\Онгоинги\\!_40_Осень_2025\\DreamCast\\Я был предан товарищами в глубине подземелья");

//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\[Фильм] Дракон-горничная госпожи Кобаяши - Одинокий дракон");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\А первый раз с андроидом считается");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Адский рай\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\В команде героя была милая девушка, так что я признался ей");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Волшебник Кунон всё видит");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Время пыток, принцесса!\\ТВ-2");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Ганглион");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Дело Арне");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Дневник разных стран");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Дочь короля демонов слишком добрая!");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Захват мира кайдзю");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Инугами и Нэкояма");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Кае не страшно");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Копэн");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Неужели ты думаешь, что кто-то вроде тебя сможет победить повелителя демонов");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Один на вылет");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Повседневная жизнь одинокого двадцатидевятилетнего авантюриста");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Повседневная жизнь стажёра-мучителя");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Предложение отпуска для скромного дворянина");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Прекрасная вечерняя луна");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Приговорённый быть героем");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Принц соседней страны обожает злодейку");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Реинкарнация аристократа - Благословенный с рождения величайшей силой");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Смертельная игра ради еды на столе");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Тандзабуро Тоджима хочет стать Наездником в маске");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Тетрадь дружбы Нацумэ\\ТВ-7");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Триган - Наблюдая за звёздами");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Ты и я - полные противоположности");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Учитель-мизантроп в классе нелюдей");
//await scan("F:\\Аниме\\Онгоинги\\!_41_Зима_2026\\DreamCast\\Человек-невидимка и обычная девушка");

//await scan("F:\\Аниме\\Онгоинги\\!_42_Весна_2026\\DreamCast\\Боевой петух");

//await scan("F:\\Аниме\\Новое\\Макен-ки\\ТВ-1");
//await scan("F:\\Аниме\\Новое\\Макен-ки\\ТВ-2");
//await scan("F:\\Аниме\\Новое\\Няруко!\\SP");
//await scan("F:\\Аниме\\Новое\\Няруко!\\ТВ-1");
//await scan("F:\\Аниме\\Новое\\Няруко!\\ТВ-2");
//await scan("F:\\Аниме\\Новое\\Любовь и прочие неприятности\\ТВ-2");
//await scan("F:\\Аниме\\Новое\\Любовь и прочие неприятности\\ТВ-4");
//await scan("F:\\Аниме\\Новое\\[New-0]\\Ведьмочка Рурумо");
//await scan("F:\\Аниме\\Новое\\[New-0]\\Вишневый Квартет\\ТВ-1");
//await scan("F:\\Аниме\\Новое\\[New-0]\\Вишневый Квартет\\ТВ-2");
//await scan("F:\\Аниме\\Новое\\[New-0]\\Лаборатория Любви");
//await scan("F:\\Аниме\\Новое\\[New-0]\\Моя первая гяру");

//await scan("F:\\Аниме\\Новое\\Любовь и прочие неприятности\\ТВ-1");
//await scan("F:\\Аниме\\Новое\\Любовь и прочие неприятности\\ТВ-3");
//await scan("F:\\Аниме\\Новое\\[New-0]\\[OVA] Мой пушистый кролик");
//await scan("F:\\Аниме\\Новое\\[New-0]\\[OVA] Хроники молодоженов");
//await scan("F:\\Аниме\\Новое\\[New-0]\\[OVA] Электромагнитная подружка");
//await scan("F:\\Аниме\\Новое\\[New-0]\\[OVA] Эти восхитительные Дети");
//await scan("F:\\Аниме\\Новое\\[New-0]\\Вишневый Квартет\\OVA");
//await scan("F:\\Аниме\\Новое\\[New-0]\\Полифоника");

//await scan("F:\\Аниме\\Amber\\[Фильм] Актриса тысячелетия");
//await scan("F:\\Аниме\\Amber\\[Фильм] Принцесса и пилот");
//await scan("F:\\Аниме\\Amber\\Баскетбол Куроко");
//await scan("F:\\Аниме\\Amber\\Евангелион");
//await scan("F:\\Аниме\\Amber\\Небесные скитальцы");
//await scan("F:\\Аниме\\Amber\\Шальная мечта!");
//await scan("F:\\Аниме\\Amber\\RWBY\\World of Remnant");
//await scan("F:\\Аниме\\Amber\\RWBY\\ТВ-3");
//await scan("F:\\Аниме\\Amber\\RWBY\\ТВ-4");
//await scan("F:\\Аниме\\Amber\\RWBY\\ТВ-6");
//await scan("F:\\Аниме\\Amber\\RWBY\\ТВ-7");
//await scan("F:\\Аниме\\Amber\\Лазарь");
//await scan("F:\\Аниме\\Amber\\Ниер - Автомата\\ТВ-1");
//await scan("F:\\Аниме\\Amber\\Ниер - Автомата\\ТВ-2");
//await scan("F:\\Аниме\\Amber\\Спираль");
//await scan("F:\\Аниме\\Amber\\Зверь нового типа");
//await scan("F:\\Аниме\\Amber\\Дандадан");
//await scan("F:\\Аниме\\Amber\\Девочки и танки");
//await scan("F:\\Аниме\\Amber\\Играй, Эуфониум!\\ТВ-3");
//await scan("F:\\Аниме\\Amber\\Играй, Эуфониум!\\Фильм");
//await scan("F:\\Аниме\\Amber\\Невеста чародея\\ТВ-2");
//await scan("F:\\Аниме\\Amber\\Плутон");
//await scan("F:\\Аниме\\Amber\\Подземелье вкусностей");
//await scan("F:\\Аниме\\Amber\\Поднятие уровня в одиночку");
//await scan("F:\\Аниме\\Amber\\Сага о Винланде");

//await scan("F:\\Аниме\\[Топ]\\Fate\\Начало");
//await scan("F:\\Аниме\\[Топ]\\SAO\\Альтернативная 'Призрачная пуля'\\ТВ-1");
//await scan("F:\\Аниме\\[Топ]\\Альтернативная игра богов");
//await scan("F:\\Аниме\\[Топ]\\Волшебный учитель Нэгима - Хранитель вечности\\OVA");
//await scan("F:\\Аниме\\[Топ]\\Может, я встречу тебя в подземелье\\ТВ-3");
//await scan("F:\\Аниме\\[Топ]\\О моём перерождении в слизь\\ТВ-3");
//await scan("F:\\Аниме\\[Топ]\\Старшая карта");
//await scan("F:\\Аниме\\[Топ]\\Хантер х Хантер");

//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Мои девушки\\ТВ-1");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Мои девушки\\ТВ-2");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Сделанно в бездне\\ТВ-2");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Сильнейший в истории ученик Кейчи");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Убийца гоблинов\\[Фильм] Корона гоблина");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Убийца гоблинов\\ТВ-1");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Цугумомо\\ТВ-1");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Цугумомо\\ТВ-2");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Школа убийц\\ТВ-1");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Школа убийц\\ТВ-2");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Этот замечательный мир!\\Одаривая этот замечательный мир взрывами!");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Этот замечательный мир!\\ТВ-3");

//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\WIXOSS\\Лострейдж - Объединение WIXOSS");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Великая небесная стена");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Второй размер, интим предлагать!");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Живая любовь! Клуб идолов старшей школы Нидзигасаки");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Заклинательница зверей Эрин");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Красавица-воин Сейлор Мун\\[Фильм] Космос");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Магазинчик начинающего алхимика");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Магическая битва\\ТВ-1");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Магическая революция перерождённой принцессы и гениальной юной леди");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Мангака и все-все-все");

//await scan("F:\\Аниме\\[Топ]\\WIXOSS\\Diva(A)Live");
//await scan("F:\\Аниме\\[Топ]\\Лиричная волшебница Наноха\\[Фильм-1] Детонация");
//await scan("F:\\Аниме\\[Топ]\\Лиричная волшебница Наноха\\ТВ-2");

//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Меж двух огней - Девушки и подруги детства");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Низкоуровневый Томозаки\\ТВ-1");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Повседневная жизнь с хозяйкой Сунохары");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Призрачный мир мириады цветов");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Реинкарнация сильнейшего оммёдзи");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Сказ о парии");
//await scan("F:\\Аниме\\[Топ]\\[Топ-3]\\Темная богиня");

//await scan("F:\\Аниме\\Onibaku\\[Фильм] Волшебница Мадока Магика");
//await scan("F:\\Аниме\\Onibaku\\Граница пустоты - Сад грешников");
//await scan("F:\\Аниме\\Onibaku\\Re - Жизнь в альтернативном мире с нуля\\ТВ-1");
//await scan("F:\\Аниме\\Onibaku\\Синий экзорцист\\ТВ-1");
//await scan("F:\\Аниме\\Onibaku\\Ди Грей-мен");
//await scan("F:\\Аниме\\Onibaku\\Пожиратель Душ");

//await scan("F:\\Аниме\\Onibaku\\[Onibaku-1]\\Ещё раз «иппон»!");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-1]\\Хроники рагнарёка\\ТВ-2");

//await scan("F:\\Аниме\\Onibaku\\[Onibaku-2]\\[Фильм] Книжная лакомка");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-2]\\Биско-ржавоед");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-2]\\Князь тьмы меняет профессию!");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-2]\\Пожалуйста! Учитель");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-2]\\Фотографируя девушек");

//await scan("F:\\Аниме\\Onibaku\\[Onibaku-3]\\Буйство цветов - Самурай невеста");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-3]\\Падшая с небес");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-3]\\Восточный Эдем");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-3]\\Очень приятно, Бог");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-4]\\АН-ГО");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-4]\\Записки о робототехнике");

//await scan("F:\\Аниме\\Onibaku\\[Onibaku-5]\\Моя геройская академия\\ТВ-3");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-5]\\Моя геройская академия\\ТВ-5\\[Фильм] Миссия мировых героев");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-5]\\New game");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-5]\\Акаги, легенда маджонга");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-5]\\Бродяга Кеншин");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-5]\\Дети на склоне");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-5]\\Психопаспорт");
//await scan("F:\\Аниме\\Onibaku\\[Onibaku-5]\\Хакуоки");

//await scan("F:\\Аниме\\[Фильмы]\\[Фильм] Юная революционерка Утэна - Конец Света юности");

//await scan("F:\\Аниме\\Amber\\[ONA]\\Вампир в саду");
//await scan("F:\\Аниме\\Amber\\[Фильм] Ni no Kuni");
//await scan("F:\\Аниме\\Amber\\[Фильм] Код Гиасс - Восстание Лелуша");
//await scan("F:\\Аниме\\Amber\\[Фильм] Мэри и ведьмин цветок");
//await scan("F:\\Аниме\\Amber\\RWBY\\ТВ-1");
//await scan("F:\\Аниме\\Amber\\RWBY\\ТВ-2");
//await scan("F:\\Аниме\\Amber\\RWBY\\ТВ-5");
//await scan("F:\\Аниме\\Amber\\RWBY\\ТВ-8");
//await scan("F:\\Аниме\\Amber\\RWBY\\ТВ-9");
//await scan("F:\\Аниме\\Amber\\Кэрол и Тьюсдэй");
